# print(6, 7, 'рвыл', "djhka")  #вывод на экран
# # текст всегда внутри кавычек
# print(5 + 6)
# print(8 * 9, (17 - 2)*2)
# print(90 - 5)
# print(70/6)  # деление с остатком
# print(70//6)  #целочисленное деление (все что после запятой не будет выведено)
# print(6**2)  #степень
# print(70 % 6)  #остаток от деления

a = 8
b = 10
print(a + b)
print(a - b)
print(a * 5 - 7, b)
a = 'rara4о'
print(a)

c = 9
print(c + b)
# print(a + c)

# int - 'это целые числа'
# str - 'это строка, которая содержит ЛЮБЫЕ символы'

s1 = 'ki'
s2 = 'ra'
print(s1 + s2)

