#Сколько существует десятичных чисел, которые делятся на 5, при условии что все цифры числа различные?
count = 0
print(int('1000', 5))